In [1]:
import numpy as np
import pandas as pd

In [1]:
dict1={
    "name":["Kunal","Harry","Ishan"],
    "marks":[99,94,33]
}

In [2]:
df=pd.DataFrame(dict1)#creates an excel sheet using pandas type display of data in df variable

NameError: name 'pd' is not defined

In [5]:
df#identifies column with column names and rows with indexes

    name  marks
0  Kunal     99
1  Harry     94
2  Ishan     33

In [6]:
df.to_csv("friends.csv")#creates a csv(excel sheet) file and put the data of df their.

In [8]:
df.to_csv("friends_index_false.csv",index=False)#creates a csv(excel sheet) file and put the data of df there without indexing No index present now.

In [9]:
df.head(2)#shows the first two data in the table

    name  marks
0  Kunal     99
1  Harry     94

In [10]:
df.tail(2)#shows the last two data in df table

    name  marks
1  Harry     94
2  Ishan     33

In [13]:
df.describe()#describes all the columns with numerical data in it give some statistical analysis.

           marks
count   3.000000
mean   75.333333
std    36.746882
min    33.000000
25%    63.500000
50%    94.000000
75%    96.500000
max    99.000000

In [17]:
readdata=pd.read_csv("friends_toread.csv")#reads a csv file using pandas and store it as a dataframe(2D array) in readdata variable

In [15]:
readdata

   Unnamed: 0   name  marks     city
0           0  Kunal     99  dhanbad
1           1  Harry     94    delhi
2           2  Ishan     33  kolkata

In [18]:
readdata["city"] # to display any particular column readdata is like a 2D array

0    dhanbad
1      delhi
2    kolkata
Name: city, dtype: object

In [19]:
readdata["city"][0]

'dhanbad'

In [21]:
readdata.to_csv("friends.csv")#s here the previous data in csv file is completely erased and changed with new data

In [22]:
df.index=["First","Second","Third"]#here the default indexes(0,1,2) changes to new indexes.

In [23]:
df

         name  marks
First   Kunal     99
Second  Harry     94
Third   Ishan     33